---
kind: method
id: M:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.Dispose
source: html/aa43d1bc-a1e9-f338-5b3a-63e38aa1666b.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.Dispose Method

Releases all resources used by the NonContinuousRailStructure

## Syntax (C#)
```csharp
public void Dispose()
```